:PROPERTIES:
:ID:       a22dcb98-903d-44d2-8e82-4ddcd95d6325
:END:
#+title: Ma config emacs

[[/home/kim/.emacs::258][.EMACS]]

[[/home/kim/.emacs.d/config-perso.el][CONFIG PERSO emacs]]
#+begin_src emacs-lisp 
(load-file "/home/kim/.emacs.d/config-perso.el")
#+end_src

*** Police 
  #+begin_src emacs-lisp :tangle ~/.emacs.d/config-perso.el
  (add-to-list 'default-frame-alist
	       '(font . "DejaVu Sans Mono-12"))
  ;; CHANGER TAILLE POLICE ICI
  #+end_src

  #+RESULTS:
  : ((font . DejaVu Sans Mono-12))

**** python restart
    #+begin_src emacs-lisp :tangle ~/.emacs.d/config-perso.el
    ;; On rajoute un hook pour avoir le raccourci C-c ! pour changer d'interpreteur python:

    (setq python-shell-interpreter "/usr/bin/python3.8") ;; IMPORTANT: On et l'interpréteur python pour les pb avec matplotlib
    (defun restart-python ()
      (interactive)
      (kill-buffer "*Python*")
      (run-python nil nil nil)
      (switch-to-buffer-other-window "*Python*")
      (other-window 1))

    (add-hook 'python-mode-hook
	      (lambda ()
		(local-set-key (kbd "M-p") 'restart-python)))
    #+end_src

    #+RESULTS:
    | elpy-mode | my/python-mode-hook | jedi:setup | my-python-mode-hook | lsp | anaconda-eldoc-mode | anaconda-mode | (lambda nil (local-set-key (kbd M-p) 'restart-python)) | setup-flycheck-python |

